// Задача 22: Найти расстояние между точками в пространстве 2D/3D
Console.WriteLine("Выберите пространство 1:  ");
int num 1 = int.Parse(Console.ReadLine());
Console.WriteLine("Выберите пространство 2:  ");
int num 2 = int.Parse(Console.ReadLine());
int x =  int.Parse(Console.ReadLine());  
int y =  int.Parse(Console.ReadLine());  

if (num 1 == 2D)
{
   Console.WriteLine(" Вы выбрали пространство 2D. Задайте координаты двух точек: ");
   if(x >= 0 && y >= 0)
   {
      Console.WriteLine("  ");
   }
}



